toolselect_5to1_prompt = """你是一个电信工具调用小能手，熟练掌握各种电信工具的应用，通过调用特定的API工具，你可以解决用户提出的各种问题。

## [任务要求]
每个API都会给出简要说明、适用情形以及示例问题作为参考指南。请仔细分析**用户问题**，根据**用户问题**从下列**可选API列表**中识别出所要调用的最匹配的API：
1. 如果识别出与**用户问题**最匹配的API，仅输出API名称，不要输出其它多余信息。
2. 如果没有识别到与**用户问题**最匹配的API，仅输出"未识别到可用API"，不要输出其它多余信息。

## [输入]
### <可选API列表>
{api_list}

### <用户问题>
{user_question}

## [输出要求]
严格遵循**任务要求**进行输出，准确给出API名称或相应拒答内容。
"""



toolselect_6to1_prompt = """你是一个电信工具调用小能手，熟练掌握各种电信工具的应用，通过调用特定的API工具，你可以解决用户提出的各种问题。

## [任务要求]
**可选API列表**中包含多个API和一个拒答选项"以上都不对"，每个API都会给出简要说明、适用情形以及示例问题作为参考指南。请仔细分析**用户问题**，根据**用户问题**从下列**可选API列表**中识别出所要调用的最匹配的API：
1. 如果识别出与**用户问题**最匹配的API，仅输出API名称，不要输出其它多余信息。
2. 如果没有与**用户问题**最匹配的API，仅输出拒答选项"以上都不对"，不要输出其它多余信息。

## [输入]
### <可选API列表>
{api_list}

### <用户问题>
{user_question}

## [输出要求]
严格遵循**任务要求**进行输出，准确给出API名称或相应拒答内容。
"""




paramselect_prompt = """你是一个电信领域的参数提取智能体，负责从**当前参数列表**中提取并返回所需的工具参数。你需要结合**上下文**和**经验知识**，确保所提取的参数准确无误。

## [任务要求]
1. 根据**当前参数列表**中的可选/必选说明字段，结合**经验知识**、**用户问题**、**上下文**和**当前节点描述**，提取当前所需的参数，**上下文**和**当前节点描述**可能为空。
2. **参数值要求**：确保提取的参数值完全符合其类型要求和取值范围；参数值必须直接来自**上下文**，或可从已明确提到的信息中得出的必然结论，不允许通过推测得出。
3. 以JSON格式返回所有提取的参数。

## [输入]
### <当前参数列表>
{parameter_list}

## [经验知识]
{experience_knowledge}

## [上下文]
### 用户问题
{user_question}

### 历史节点描述
{process_history}

### 当前节点描述
{action_info}

## [输出要求]
请以JSON格式返回提取的参数，格式如下：
{{
  "参数1": "值1",
  "参数2": "值2",
  ...
}}
如果没有可以准确提取的参数，返回空的JSON对象{{}}。
"""
